const _ = require('lodash'); //Імпорт бібліотеки Lodash

console.log(_.chunk([1, 2, 3, 4], 2)); //Розбиває масив на менші масиви заданого розміру n (2).

console.log(_.compact([0, 1, false, 2, '', 3])); //Видаляє всі помилкові значення (false, null, 0, '', undefined і NaN) з масиву

console.log(_.concat([1], 2, 3)); //Об’єднує два або більше масивів або значень у новий масив.

console.log(_.difference([1, 2, 3, 4], [2, 3])); //Створює новий масив зі значеннями з першого масиву, яких немає в другому масиві.

console.log(_.drop([1, 2, 3, 4, 5], 2)); //Створює новий масив з усіма елементами, крім перших n (2) елементів заданого масиву.